BAS BMEKZU Project/src/Catalogs/СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов/СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов</name>
  <tabularSections>
    <name>СтатьиЗатрат</name>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗатрат</name>
      <type>
        <types>EnumRef.ВидыЗатрат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/Catalogs/СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура СтатьиЗатратСтатьяЗатратПриИзменении(Элемент)
	
	//Объект.СтатьиЗатрат.Получить(Элементы.СтатьиЗатрат.ТекущаяСтрока).ВидЗатрат = Объект.СтатьиЗатрат.Получить(Элементы.СтатьиЗатрат.ТекущаяСтрока).СтатьяЗатрат.ВидЗатрат;
	Элементы.СтатьиЗатрат.ТекущиеДанные.ВидЗатрат = ПолучитьВидЗатрат(Элементы.СтатьиЗатрат.ТекущиеДанные.СтатьяЗатрат);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидЗатрат(СтатьяЗатрат)
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтатьяЗатрат, "ВидЗатрат").ВидЗатрат;
	
КонецФункции
